    /*Напишите программу, выводящую в консоль It's alive! It's alive!
    Класс должен называться "Main", это ограничение проверяющей системы.

    Sample Input:

    Sample Output:
    It's alive! It's alive!
    */

package org.example;

class Stepik_Task1 {
    public static void main(String[] args) {
        System.out.print("It's alive! It's alive!");
    }
}